StoveOpt/tests/test_results/case_3333333333/0/details
Velocity
33.33333333